LuckiBit/stm32-template/stm32f429ig/bootloader/hardware/bsp/gpio/bsp_gpio.c
/**
 * @file bsp_gpio.c
 * @brief Configures every package GPIO from an independent per-pin macro block.
 */

#include "bsp_gpio.h"

#include "stm32f4xx_hal.h"

#include <stddef.h>
#include <stdint.h>

/*
 * Modify only the macros in the required pin block when its electrical
 * configuration changes. HSE and debug pins remain listed but INITIALIZE is false.
 */
/* GPIOA pin 0 configuration. */
#define BSP_GPIOA_0_PORT          GPIOA
#define BSP_GPIOA_0_PIN           GPIO_PIN_0
#define BSP_GPIOA_0_INITIALIZE    true
#define BSP_GPIOA_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_0_PULL          GPIO_NOPULL
#define BSP_GPIOA_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_0_IS_OUTPUT     false

/* GPIOA pin 1 configuration. */
#define BSP_GPIOA_1_PORT          GPIOA
#define BSP_GPIOA_1_PIN           GPIO_PIN_1
#define BSP_GPIOA_1_INITIALIZE    true
#define BSP_GPIOA_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_1_PULL          GPIO_NOPULL
#define BSP_GPIOA_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_1_IS_OUTPUT     false

/* GPIOA pin 2 configuration. */
#define BSP_GPIOA_2_PORT          GPIOA
#define BSP_GPIOA_2_PIN           GPIO_PIN_2
#define BSP_GPIOA_2_INITIALIZE    true
#define BSP_GPIOA_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_2_PULL          GPIO_NOPULL
#define BSP_GPIOA_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_2_IS_OUTPUT     false

/* GPIOA pin 3 configuration. */
#define BSP_GPIOA_3_PORT          GPIOA
#define BSP_GPIOA_3_PIN           GPIO_PIN_3
#define BSP_GPIOA_3_INITIALIZE    true
#define BSP_GPIOA_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_3_PULL          GPIO_NOPULL
#define BSP_GPIOA_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_3_IS_OUTPUT     false

/* GPIOA pin 4 configuration. */
#define BSP_GPIOA_4_PORT          GPIOA
#define BSP_GPIOA_4_PIN           GPIO_PIN_4
#define BSP_GPIOA_4_INITIALIZE    true
#define BSP_GPIOA_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_4_PULL          GPIO_NOPULL
#define BSP_GPIOA_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_4_IS_OUTPUT     false

/* GPIOA pin 5 configuration. */
#define BSP_GPIOA_5_PORT          GPIOA
#define BSP_GPIOA_5_PIN           GPIO_PIN_5
#define BSP_GPIOA_5_INITIALIZE    true
#define BSP_GPIOA_5_MODE          GPIO_MODE_OUTPUT_PP
#define BSP_GPIOA_5_PULL          GPIO_NOPULL
#define BSP_GPIOA_5_SPEED         GPIO_SPEED_FREQ_HIGH
#define BSP_GPIOA_5_INITIAL_STATE GPIO_PIN_SET
#define BSP_GPIOA_5_SAFE_STATE    GPIO_PIN_SET
#define BSP_GPIOA_5_IS_OUTPUT     true

/* GPIOA pin 6 configuration. */
#define BSP_GPIOA_6_PORT          GPIOA
#define BSP_GPIOA_6_PIN           GPIO_PIN_6
#define BSP_GPIOA_6_INITIALIZE    true
#define BSP_GPIOA_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_6_PULL          GPIO_NOPULL
#define BSP_GPIOA_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_6_IS_OUTPUT     false

/* GPIOA pin 7 configuration. */
#define BSP_GPIOA_7_PORT          GPIOA
#define BSP_GPIOA_7_PIN           GPIO_PIN_7
#define BSP_GPIOA_7_INITIALIZE    true
#define BSP_GPIOA_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_7_PULL          GPIO_NOPULL
#define BSP_GPIOA_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_7_IS_OUTPUT     false

/* GPIOA pin 8 configuration. */
#define BSP_GPIOA_8_PORT          GPIOA
#define BSP_GPIOA_8_PIN           GPIO_PIN_8
#define BSP_GPIOA_8_INITIALIZE    true
#define BSP_GPIOA_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_8_PULL          GPIO_NOPULL
#define BSP_GPIOA_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_8_IS_OUTPUT     false

/* GPIOA pin 9 configuration. */
#define BSP_GPIOA_9_PORT          GPIOA
#define BSP_GPIOA_9_PIN           GPIO_PIN_9
#define BSP_GPIOA_9_INITIALIZE    true
#define BSP_GPIOA_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_9_PULL          GPIO_NOPULL
#define BSP_GPIOA_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_9_IS_OUTPUT     false

/* GPIOA pin 10 configuration. */
#define BSP_GPIOA_10_PORT          GPIOA
#define BSP_GPIOA_10_PIN           GPIO_PIN_10
#define BSP_GPIOA_10_INITIALIZE    true
#define BSP_GPIOA_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_10_PULL          GPIO_NOPULL
#define BSP_GPIOA_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_10_IS_OUTPUT     false

/* GPIOA pin 11 configuration. */
#define BSP_GPIOA_11_PORT          GPIOA
#define BSP_GPIOA_11_PIN           GPIO_PIN_11
#define BSP_GPIOA_11_INITIALIZE    true
#define BSP_GPIOA_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_11_PULL          GPIO_NOPULL
#define BSP_GPIOA_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_11_IS_OUTPUT     false

/* GPIOA pin 12 configuration. */
#define BSP_GPIOA_12_PORT          GPIOA
#define BSP_GPIOA_12_PIN           GPIO_PIN_12
#define BSP_GPIOA_12_INITIALIZE    true
#define BSP_GPIOA_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_12_PULL          GPIO_NOPULL
#define BSP_GPIOA_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_12_IS_OUTPUT     false

/* GPIOA pin 13 configuration. */
#define BSP_GPIOA_13_PORT          GPIOA
#define BSP_GPIOA_13_PIN           GPIO_PIN_13
#define BSP_GPIOA_13_INITIALIZE    false
#define BSP_GPIOA_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_13_PULL          GPIO_NOPULL
#define BSP_GPIOA_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_13_IS_OUTPUT     false

/* GPIOA pin 14 configuration. */
#define BSP_GPIOA_14_PORT          GPIOA
#define BSP_GPIOA_14_PIN           GPIO_PIN_14
#define BSP_GPIOA_14_INITIALIZE    false
#define BSP_GPIOA_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_14_PULL          GPIO_NOPULL
#define BSP_GPIOA_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_14_IS_OUTPUT     false

/* GPIOA pin 15 configuration. */
#define BSP_GPIOA_15_PORT          GPIOA
#define BSP_GPIOA_15_PIN           GPIO_PIN_15
#define BSP_GPIOA_15_INITIALIZE    false
#define BSP_GPIOA_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOA_15_PULL          GPIO_NOPULL
#define BSP_GPIOA_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOA_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOA_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOA_15_IS_OUTPUT     false

/* GPIOB pin 0 configuration. */
#define BSP_GPIOB_0_PORT          GPIOB
#define BSP_GPIOB_0_PIN           GPIO_PIN_0
#define BSP_GPIOB_0_INITIALIZE    true
#define BSP_GPIOB_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_0_PULL          GPIO_NOPULL
#define BSP_GPIOB_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_0_IS_OUTPUT     false

/* GPIOB pin 1 configuration. */
#define BSP_GPIOB_1_PORT          GPIOB
#define BSP_GPIOB_1_PIN           GPIO_PIN_1
#define BSP_GPIOB_1_INITIALIZE    true
#define BSP_GPIOB_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_1_PULL          GPIO_NOPULL
#define BSP_GPIOB_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_1_IS_OUTPUT     false

