LuckiBit/stm32-template/stm32f429ig/bootloader/hardware/bsp/gpio/bsp_gpio.c
/* GPIOC pin 6 configuration. */
#define BSP_GPIOC_6_PORT          GPIOC
#define BSP_GPIOC_6_PIN           GPIO_PIN_6
#define BSP_GPIOC_6_INITIALIZE    true
#define BSP_GPIOC_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_6_PULL          GPIO_NOPULL
#define BSP_GPIOC_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_6_IS_OUTPUT     false

/* GPIOC pin 7 configuration. */
#define BSP_GPIOC_7_PORT          GPIOC
#define BSP_GPIOC_7_PIN           GPIO_PIN_7
#define BSP_GPIOC_7_INITIALIZE    true
#define BSP_GPIOC_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_7_PULL          GPIO_NOPULL
#define BSP_GPIOC_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_7_IS_OUTPUT     false

/* GPIOC pin 8 configuration. */
#define BSP_GPIOC_8_PORT          GPIOC
#define BSP_GPIOC_8_PIN           GPIO_PIN_8
#define BSP_GPIOC_8_INITIALIZE    true
#define BSP_GPIOC_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_8_PULL          GPIO_NOPULL
#define BSP_GPIOC_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_8_IS_OUTPUT     false

/* GPIOC pin 9 configuration. */
#define BSP_GPIOC_9_PORT          GPIOC
#define BSP_GPIOC_9_PIN           GPIO_PIN_9
#define BSP_GPIOC_9_INITIALIZE    true
#define BSP_GPIOC_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_9_PULL          GPIO_NOPULL
#define BSP_GPIOC_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_9_IS_OUTPUT     false

/* GPIOC pin 10 configuration. */
#define BSP_GPIOC_10_PORT          GPIOC
#define BSP_GPIOC_10_PIN           GPIO_PIN_10
#define BSP_GPIOC_10_INITIALIZE    true
#define BSP_GPIOC_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_10_PULL          GPIO_NOPULL
#define BSP_GPIOC_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_10_IS_OUTPUT     false

/* GPIOC pin 11 configuration. */
#define BSP_GPIOC_11_PORT          GPIOC
#define BSP_GPIOC_11_PIN           GPIO_PIN_11
#define BSP_GPIOC_11_INITIALIZE    true
#define BSP_GPIOC_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_11_PULL          GPIO_NOPULL
#define BSP_GPIOC_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_11_IS_OUTPUT     false

/* GPIOC pin 12 configuration. */
#define BSP_GPIOC_12_PORT          GPIOC
#define BSP_GPIOC_12_PIN           GPIO_PIN_12
#define BSP_GPIOC_12_INITIALIZE    true
#define BSP_GPIOC_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_12_PULL          GPIO_NOPULL
#define BSP_GPIOC_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_12_IS_OUTPUT     false

/* GPIOC pin 13 configuration. */
#define BSP_GPIOC_13_PORT          GPIOC
#define BSP_GPIOC_13_PIN           GPIO_PIN_13
#define BSP_GPIOC_13_INITIALIZE    true
#define BSP_GPIOC_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_13_PULL          GPIO_NOPULL
#define BSP_GPIOC_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_13_IS_OUTPUT     false

/* GPIOC pin 14 configuration. */
#define BSP_GPIOC_14_PORT          GPIOC
#define BSP_GPIOC_14_PIN           GPIO_PIN_14
#define BSP_GPIOC_14_INITIALIZE    true
#define BSP_GPIOC_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_14_PULL          GPIO_NOPULL
#define BSP_GPIOC_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_14_IS_OUTPUT     false

/* GPIOC pin 15 configuration. */
#define BSP_GPIOC_15_PORT          GPIOC
#define BSP_GPIOC_15_PIN           GPIO_PIN_15
#define BSP_GPIOC_15_INITIALIZE    true
#define BSP_GPIOC_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_15_PULL          GPIO_NOPULL
#define BSP_GPIOC_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_15_IS_OUTPUT     false

/* GPIOD pin 0 configuration. */
#define BSP_GPIOD_0_PORT          GPIOD
#define BSP_GPIOD_0_PIN           GPIO_PIN_0
#define BSP_GPIOD_0_INITIALIZE    true
#define BSP_GPIOD_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_0_PULL          GPIO_NOPULL
#define BSP_GPIOD_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_0_IS_OUTPUT     false

/* GPIOD pin 1 configuration. */
#define BSP_GPIOD_1_PORT          GPIOD
#define BSP_GPIOD_1_PIN           GPIO_PIN_1
#define BSP_GPIOD_1_INITIALIZE    true
#define BSP_GPIOD_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_1_PULL          GPIO_NOPULL
#define BSP_GPIOD_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_1_IS_OUTPUT     false

/* GPIOD pin 2 configuration. */
#define BSP_GPIOD_2_PORT          GPIOD
#define BSP_GPIOD_2_PIN           GPIO_PIN_2
#define BSP_GPIOD_2_INITIALIZE    true
#define BSP_GPIOD_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_2_PULL          GPIO_NOPULL
#define BSP_GPIOD_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_2_IS_OUTPUT     false

/* GPIOD pin 3 configuration. */
#define BSP_GPIOD_3_PORT          GPIOD
#define BSP_GPIOD_3_PIN           GPIO_PIN_3
#define BSP_GPIOD_3_INITIALIZE    true
#define BSP_GPIOD_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_3_PULL          GPIO_NOPULL
#define BSP_GPIOD_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_3_IS_OUTPUT     false

/* GPIOD pin 4 configuration. */
#define BSP_GPIOD_4_PORT          GPIOD
#define BSP_GPIOD_4_PIN           GPIO_PIN_4
#define BSP_GPIOD_4_INITIALIZE    true
#define BSP_GPIOD_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_4_PULL          GPIO_NOPULL
#define BSP_GPIOD_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_4_IS_OUTPUT     false

/* GPIOD pin 5 configuration. */
#define BSP_GPIOD_5_PORT          GPIOD
#define BSP_GPIOD_5_PIN           GPIO_PIN_5
#define BSP_GPIOD_5_INITIALIZE    true
#define BSP_GPIOD_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_5_PULL          GPIO_NOPULL
#define BSP_GPIOD_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_5_IS_OUTPUT     false

