LuckiBit/stm32-template/stm32f429ig/bootloader/hardware/bsp/gpio/bsp_gpio.c
/* GPIOE pin 8 configuration. */
#define BSP_GPIOE_8_PORT          GPIOE
#define BSP_GPIOE_8_PIN           GPIO_PIN_8
#define BSP_GPIOE_8_INITIALIZE    true
#define BSP_GPIOE_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_8_PULL          GPIO_NOPULL
#define BSP_GPIOE_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_8_IS_OUTPUT     false

/* GPIOE pin 9 configuration. */
#define BSP_GPIOE_9_PORT          GPIOE
#define BSP_GPIOE_9_PIN           GPIO_PIN_9
#define BSP_GPIOE_9_INITIALIZE    true
#define BSP_GPIOE_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_9_PULL          GPIO_NOPULL
#define BSP_GPIOE_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_9_IS_OUTPUT     false

/* GPIOE pin 10 configuration. */
#define BSP_GPIOE_10_PORT          GPIOE
#define BSP_GPIOE_10_PIN           GPIO_PIN_10
#define BSP_GPIOE_10_INITIALIZE    true
#define BSP_GPIOE_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_10_PULL          GPIO_NOPULL
#define BSP_GPIOE_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_10_IS_OUTPUT     false

/* GPIOE pin 11 configuration. */
#define BSP_GPIOE_11_PORT          GPIOE
#define BSP_GPIOE_11_PIN           GPIO_PIN_11
#define BSP_GPIOE_11_INITIALIZE    true
#define BSP_GPIOE_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_11_PULL          GPIO_NOPULL
#define BSP_GPIOE_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_11_IS_OUTPUT     false

/* GPIOE pin 12 configuration. */
#define BSP_GPIOE_12_PORT          GPIOE
#define BSP_GPIOE_12_PIN           GPIO_PIN_12
#define BSP_GPIOE_12_INITIALIZE    true
#define BSP_GPIOE_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_12_PULL          GPIO_NOPULL
#define BSP_GPIOE_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_12_IS_OUTPUT     false

/* GPIOE pin 13 configuration. */
#define BSP_GPIOE_13_PORT          GPIOE
#define BSP_GPIOE_13_PIN           GPIO_PIN_13
#define BSP_GPIOE_13_INITIALIZE    true
#define BSP_GPIOE_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_13_PULL          GPIO_NOPULL
#define BSP_GPIOE_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_13_IS_OUTPUT     false

/* GPIOE pin 14 configuration. */
#define BSP_GPIOE_14_PORT          GPIOE
#define BSP_GPIOE_14_PIN           GPIO_PIN_14
#define BSP_GPIOE_14_INITIALIZE    true
#define BSP_GPIOE_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_14_PULL          GPIO_NOPULL
#define BSP_GPIOE_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_14_IS_OUTPUT     false

/* GPIOE pin 15 configuration. */
#define BSP_GPIOE_15_PORT          GPIOE
#define BSP_GPIOE_15_PIN           GPIO_PIN_15
#define BSP_GPIOE_15_INITIALIZE    true
#define BSP_GPIOE_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_15_PULL          GPIO_NOPULL
#define BSP_GPIOE_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_15_IS_OUTPUT     false

/* GPIOF pin 0 configuration. */
#define BSP_GPIOF_0_PORT          GPIOF
#define BSP_GPIOF_0_PIN           GPIO_PIN_0
#define BSP_GPIOF_0_INITIALIZE    true
#define BSP_GPIOF_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_0_PULL          GPIO_NOPULL
#define BSP_GPIOF_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_0_IS_OUTPUT     false

/* GPIOF pin 1 configuration. */
#define BSP_GPIOF_1_PORT          GPIOF
#define BSP_GPIOF_1_PIN           GPIO_PIN_1
#define BSP_GPIOF_1_INITIALIZE    true
#define BSP_GPIOF_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_1_PULL          GPIO_NOPULL
#define BSP_GPIOF_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_1_IS_OUTPUT     false

/* GPIOF pin 2 configuration. */
#define BSP_GPIOF_2_PORT          GPIOF
#define BSP_GPIOF_2_PIN           GPIO_PIN_2
#define BSP_GPIOF_2_INITIALIZE    true
#define BSP_GPIOF_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_2_PULL          GPIO_NOPULL
#define BSP_GPIOF_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_2_IS_OUTPUT     false

/* GPIOF pin 3 configuration. */
#define BSP_GPIOF_3_PORT          GPIOF
#define BSP_GPIOF_3_PIN           GPIO_PIN_3
#define BSP_GPIOF_3_INITIALIZE    true
#define BSP_GPIOF_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_3_PULL          GPIO_NOPULL
#define BSP_GPIOF_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_3_IS_OUTPUT     false

/* GPIOF pin 4 configuration. */
#define BSP_GPIOF_4_PORT          GPIOF
#define BSP_GPIOF_4_PIN           GPIO_PIN_4
#define BSP_GPIOF_4_INITIALIZE    true
#define BSP_GPIOF_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_4_PULL          GPIO_NOPULL
#define BSP_GPIOF_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_4_IS_OUTPUT     false

/* GPIOF pin 5 configuration. */
#define BSP_GPIOF_5_PORT          GPIOF
#define BSP_GPIOF_5_PIN           GPIO_PIN_5
#define BSP_GPIOF_5_INITIALIZE    true
#define BSP_GPIOF_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_5_PULL          GPIO_NOPULL
#define BSP_GPIOF_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_5_IS_OUTPUT     false

/* GPIOF pin 6 configuration. */
#define BSP_GPIOF_6_PORT          GPIOF
#define BSP_GPIOF_6_PIN           GPIO_PIN_6
#define BSP_GPIOF_6_INITIALIZE    true
#define BSP_GPIOF_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_6_PULL          GPIO_NOPULL
#define BSP_GPIOF_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_6_IS_OUTPUT     false

/* GPIOF pin 7 configuration. */
#define BSP_GPIOF_7_PORT          GPIOF
#define BSP_GPIOF_7_PIN           GPIO_PIN_7
#define BSP_GPIOF_7_INITIALIZE    true
#define BSP_GPIOF_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_7_PULL          GPIO_NOPULL
#define BSP_GPIOF_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_7_IS_OUTPUT     false

/* GPIOF pin 8 configuration. */
#define BSP_GPIOF_8_PORT          GPIOF
#define BSP_GPIOF_8_PIN           GPIO_PIN_8
#define BSP_GPIOF_8_INITIALIZE    true
#define BSP_GPIOF_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_8_PULL          GPIO_NOPULL
#define BSP_GPIOF_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_8_IS_OUTPUT     false

/* GPIOF pin 9 configuration. */
#define BSP_GPIOF_9_PORT          GPIOF
#define BSP_GPIOF_9_PIN           GPIO_PIN_9
#define BSP_GPIOF_9_INITIALIZE    true
#define BSP_GPIOF_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_9_PULL          GPIO_NOPULL
#define BSP_GPIOF_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_9_IS_OUTPUT     false

/* GPIOF pin 10 configuration. */
#define BSP_GPIOF_10_PORT          GPIOF
#define BSP_GPIOF_10_PIN           GPIO_PIN_10
#define BSP_GPIOF_10_INITIALIZE    true
#define BSP_GPIOF_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_10_PULL          GPIO_NOPULL
#define BSP_GPIOF_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_10_IS_OUTPUT     false

/* GPIOF pin 11 configuration. */
#define BSP_GPIOF_11_PORT          GPIOF
#define BSP_GPIOF_11_PIN           GPIO_PIN_11
#define BSP_GPIOF_11_INITIALIZE    true
#define BSP_GPIOF_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_11_PULL          GPIO_NOPULL
#define BSP_GPIOF_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_11_IS_OUTPUT     false

/* GPIOF pin 12 configuration. */
#define BSP_GPIOF_12_PORT          GPIOF
#define BSP_GPIOF_12_PIN           GPIO_PIN_12
#define BSP_GPIOF_12_INITIALIZE    true
#define BSP_GPIOF_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_12_PULL          GPIO_NOPULL
#define BSP_GPIOF_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_12_IS_OUTPUT     false

/* GPIOF pin 13 configuration. */
#define BSP_GPIOF_13_PORT          GPIOF
#define BSP_GPIOF_13_PIN           GPIO_PIN_13
#define BSP_GPIOF_13_INITIALIZE    true
#define BSP_GPIOF_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_13_PULL          GPIO_NOPULL
#define BSP_GPIOF_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_13_IS_OUTPUT     false

