LuckiBit/stm32-template/stm32f429ig/bootloader/hardware/bsp/gpio/bsp_gpio.c
/* GPIOG pin 12 configuration. */
#define BSP_GPIOG_12_PORT          GPIOG
#define BSP_GPIOG_12_PIN           GPIO_PIN_12
#define BSP_GPIOG_12_INITIALIZE    true
#define BSP_GPIOG_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_12_PULL          GPIO_NOPULL
#define BSP_GPIOG_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_12_IS_OUTPUT     false

/* GPIOG pin 13 configuration. */
#define BSP_GPIOG_13_PORT          GPIOG
#define BSP_GPIOG_13_PIN           GPIO_PIN_13
#define BSP_GPIOG_13_INITIALIZE    true
#define BSP_GPIOG_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_13_PULL          GPIO_NOPULL
#define BSP_GPIOG_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_13_IS_OUTPUT     false

/* GPIOG pin 14 configuration. */
#define BSP_GPIOG_14_PORT          GPIOG
#define BSP_GPIOG_14_PIN           GPIO_PIN_14
#define BSP_GPIOG_14_INITIALIZE    true
#define BSP_GPIOG_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_14_PULL          GPIO_NOPULL
#define BSP_GPIOG_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_14_IS_OUTPUT     false

/* GPIOG pin 15 configuration. */
#define BSP_GPIOG_15_PORT          GPIOG
#define BSP_GPIOG_15_PIN           GPIO_PIN_15
#define BSP_GPIOG_15_INITIALIZE    true
#define BSP_GPIOG_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_15_PULL          GPIO_NOPULL
#define BSP_GPIOG_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_15_IS_OUTPUT     false

/* GPIOH pin 0 configuration. */
#define BSP_GPIOH_0_PORT          GPIOH
#define BSP_GPIOH_0_PIN           GPIO_PIN_0
#define BSP_GPIOH_0_INITIALIZE    false
#define BSP_GPIOH_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_0_PULL          GPIO_NOPULL
#define BSP_GPIOH_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_0_IS_OUTPUT     false

/* GPIOH pin 1 configuration. */
#define BSP_GPIOH_1_PORT          GPIOH
#define BSP_GPIOH_1_PIN           GPIO_PIN_1
#define BSP_GPIOH_1_INITIALIZE    false
#define BSP_GPIOH_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_1_PULL          GPIO_NOPULL
#define BSP_GPIOH_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_1_IS_OUTPUT     false

/* GPIOH pin 2 configuration. */
#define BSP_GPIOH_2_PORT          GPIOH
#define BSP_GPIOH_2_PIN           GPIO_PIN_2
#define BSP_GPIOH_2_INITIALIZE    true
#define BSP_GPIOH_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_2_PULL          GPIO_NOPULL
#define BSP_GPIOH_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_2_IS_OUTPUT     false

/* GPIOH pin 3 configuration. */
#define BSP_GPIOH_3_PORT          GPIOH
#define BSP_GPIOH_3_PIN           GPIO_PIN_3
#define BSP_GPIOH_3_INITIALIZE    true
#define BSP_GPIOH_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_3_PULL          GPIO_NOPULL
#define BSP_GPIOH_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_3_IS_OUTPUT     false

/* GPIOH pin 4 configuration. */
#define BSP_GPIOH_4_PORT          GPIOH
#define BSP_GPIOH_4_PIN           GPIO_PIN_4
#define BSP_GPIOH_4_INITIALIZE    true
#define BSP_GPIOH_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_4_PULL          GPIO_NOPULL
#define BSP_GPIOH_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_4_IS_OUTPUT     false

/* GPIOH pin 5 configuration. */
#define BSP_GPIOH_5_PORT          GPIOH
#define BSP_GPIOH_5_PIN           GPIO_PIN_5
#define BSP_GPIOH_5_INITIALIZE    true
#define BSP_GPIOH_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_5_PULL          GPIO_NOPULL
#define BSP_GPIOH_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_5_IS_OUTPUT     false

/* GPIOH pin 6 configuration. */
#define BSP_GPIOH_6_PORT          GPIOH
#define BSP_GPIOH_6_PIN           GPIO_PIN_6
#define BSP_GPIOH_6_INITIALIZE    true
#define BSP_GPIOH_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_6_PULL          GPIO_NOPULL
#define BSP_GPIOH_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_6_IS_OUTPUT     false

/* GPIOH pin 7 configuration. */
#define BSP_GPIOH_7_PORT          GPIOH
#define BSP_GPIOH_7_PIN           GPIO_PIN_7
#define BSP_GPIOH_7_INITIALIZE    true
#define BSP_GPIOH_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_7_PULL          GPIO_NOPULL
#define BSP_GPIOH_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_7_IS_OUTPUT     false

/* GPIOH pin 8 configuration. */
#define BSP_GPIOH_8_PORT          GPIOH
#define BSP_GPIOH_8_PIN           GPIO_PIN_8
#define BSP_GPIOH_8_INITIALIZE    true
#define BSP_GPIOH_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_8_PULL          GPIO_NOPULL
#define BSP_GPIOH_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_8_IS_OUTPUT     false

/* GPIOH pin 9 configuration. */
#define BSP_GPIOH_9_PORT          GPIOH
#define BSP_GPIOH_9_PIN           GPIO_PIN_9
#define BSP_GPIOH_9_INITIALIZE    true
#define BSP_GPIOH_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_9_PULL          GPIO_NOPULL
#define BSP_GPIOH_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_9_IS_OUTPUT     false

/* GPIOH pin 10 configuration. */
#define BSP_GPIOH_10_PORT          GPIOH
#define BSP_GPIOH_10_PIN           GPIO_PIN_10
#define BSP_GPIOH_10_INITIALIZE    true
#define BSP_GPIOH_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_10_PULL          GPIO_NOPULL
#define BSP_GPIOH_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_10_IS_OUTPUT     false

/* GPIOH pin 11 configuration. */
#define BSP_GPIOH_11_PORT          GPIOH
#define BSP_GPIOH_11_PIN           GPIO_PIN_11
#define BSP_GPIOH_11_INITIALIZE    true
#define BSP_GPIOH_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_11_PULL          GPIO_NOPULL
#define BSP_GPIOH_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_11_IS_OUTPUT     false

/* GPIOH pin 12 configuration. */
#define BSP_GPIOH_12_PORT          GPIOH
#define BSP_GPIOH_12_PIN           GPIO_PIN_12
#define BSP_GPIOH_12_INITIALIZE    true
#define BSP_GPIOH_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_12_PULL          GPIO_NOPULL
#define BSP_GPIOH_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_12_IS_OUTPUT     false

/* GPIOH pin 13 configuration. */
#define BSP_GPIOH_13_PORT          GPIOH
#define BSP_GPIOH_13_PIN           GPIO_PIN_13
#define BSP_GPIOH_13_INITIALIZE    true
#define BSP_GPIOH_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_13_PULL          GPIO_NOPULL
#define BSP_GPIOH_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_13_IS_OUTPUT     false

/* GPIOH pin 14 configuration. */
#define BSP_GPIOH_14_PORT          GPIOH
#define BSP_GPIOH_14_PIN           GPIO_PIN_14
#define BSP_GPIOH_14_INITIALIZE    true
#define BSP_GPIOH_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_14_PULL          GPIO_NOPULL
#define BSP_GPIOH_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_14_IS_OUTPUT     false

/* GPIOH pin 15 configuration. */
#define BSP_GPIOH_15_PORT          GPIOH
#define BSP_GPIOH_15_PIN           GPIO_PIN_15
#define BSP_GPIOH_15_INITIALIZE    true
#define BSP_GPIOH_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOH_15_PULL          GPIO_NOPULL
#define BSP_GPIOH_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOH_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOH_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOH_15_IS_OUTPUT     false

/* GPIOI pin 0 configuration. */
#define BSP_GPIOI_0_PORT          GPIOI
#define BSP_GPIOI_0_PIN           GPIO_PIN_0
#define BSP_GPIOI_0_INITIALIZE    true
#define BSP_GPIOI_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_0_PULL          GPIO_NOPULL
#define BSP_GPIOI_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_0_IS_OUTPUT     false

/* GPIOI pin 1 configuration. */
#define BSP_GPIOI_1_PORT          GPIOI
#define BSP_GPIOI_1_PIN           GPIO_PIN_1
#define BSP_GPIOI_1_INITIALIZE    true
#define BSP_GPIOI_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_1_PULL          GPIO_NOPULL
#define BSP_GPIOI_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_1_IS_OUTPUT     false

