LuckiBit/stm32-template/stm32f429ig/bootloader/hardware/bsp/gpio/bsp_gpio.c
/* GPIOI pin 2 configuration. */
#define BSP_GPIOI_2_PORT          GPIOI
#define BSP_GPIOI_2_PIN           GPIO_PIN_2
#define BSP_GPIOI_2_INITIALIZE    true
#define BSP_GPIOI_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_2_PULL          GPIO_NOPULL
#define BSP_GPIOI_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_2_IS_OUTPUT     false

/* GPIOI pin 3 configuration. */
#define BSP_GPIOI_3_PORT          GPIOI
#define BSP_GPIOI_3_PIN           GPIO_PIN_3
#define BSP_GPIOI_3_INITIALIZE    true
#define BSP_GPIOI_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_3_PULL          GPIO_NOPULL
#define BSP_GPIOI_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_3_IS_OUTPUT     false

/* GPIOI pin 4 configuration. */
#define BSP_GPIOI_4_PORT          GPIOI
#define BSP_GPIOI_4_PIN           GPIO_PIN_4
#define BSP_GPIOI_4_INITIALIZE    true
#define BSP_GPIOI_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_4_PULL          GPIO_NOPULL
#define BSP_GPIOI_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_4_IS_OUTPUT     false

/* GPIOI pin 5 configuration. */
#define BSP_GPIOI_5_PORT          GPIOI
#define BSP_GPIOI_5_PIN           GPIO_PIN_5
#define BSP_GPIOI_5_INITIALIZE    true
#define BSP_GPIOI_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_5_PULL          GPIO_NOPULL
#define BSP_GPIOI_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_5_IS_OUTPUT     false

/* GPIOI pin 6 configuration. */
#define BSP_GPIOI_6_PORT          GPIOI
#define BSP_GPIOI_6_PIN           GPIO_PIN_6
#define BSP_GPIOI_6_INITIALIZE    true
#define BSP_GPIOI_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_6_PULL          GPIO_NOPULL
#define BSP_GPIOI_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_6_IS_OUTPUT     false

/* GPIOI pin 7 configuration. */
#define BSP_GPIOI_7_PORT          GPIOI
#define BSP_GPIOI_7_PIN           GPIO_PIN_7
#define BSP_GPIOI_7_INITIALIZE    true
#define BSP_GPIOI_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_7_PULL          GPIO_NOPULL
#define BSP_GPIOI_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_7_IS_OUTPUT     false

/* GPIOI pin 8 configuration. */
#define BSP_GPIOI_8_PORT          GPIOI
#define BSP_GPIOI_8_PIN           GPIO_PIN_8
#define BSP_GPIOI_8_INITIALIZE    true
#define BSP_GPIOI_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_8_PULL          GPIO_NOPULL
#define BSP_GPIOI_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_8_IS_OUTPUT     false

/* GPIOI pin 9 configuration. */
#define BSP_GPIOI_9_PORT          GPIOI
#define BSP_GPIOI_9_PIN           GPIO_PIN_9
#define BSP_GPIOI_9_INITIALIZE    true
#define BSP_GPIOI_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_9_PULL          GPIO_NOPULL
#define BSP_GPIOI_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_9_IS_OUTPUT     false

/* GPIOI pin 10 configuration. */
#define BSP_GPIOI_10_PORT          GPIOI
#define BSP_GPIOI_10_PIN           GPIO_PIN_10
#define BSP_GPIOI_10_INITIALIZE    true
#define BSP_GPIOI_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_10_PULL          GPIO_NOPULL
#define BSP_GPIOI_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_10_IS_OUTPUT     false

/* GPIOI pin 11 configuration. */
#define BSP_GPIOI_11_PORT          GPIOI
#define BSP_GPIOI_11_PIN           GPIO_PIN_11
#define BSP_GPIOI_11_INITIALIZE    true
#define BSP_GPIOI_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOI_11_PULL          GPIO_NOPULL
#define BSP_GPIOI_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOI_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOI_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOI_11_IS_OUTPUT     false

#define BSP_GPIO_PIN_CONFIG_LIST(APPLY) \
    APPLY(BSP_GPIOA_0) \
    APPLY(BSP_GPIOA_1) \
    APPLY(BSP_GPIOA_2) \
    APPLY(BSP_GPIOA_3) \
    APPLY(BSP_GPIOA_4) \
    APPLY(BSP_GPIOA_5) \
    APPLY(BSP_GPIOA_6) \
    APPLY(BSP_GPIOA_7) \
    APPLY(BSP_GPIOA_8) \
    APPLY(BSP_GPIOA_9) \
    APPLY(BSP_GPIOA_10) \
    APPLY(BSP_GPIOA_11) \
    APPLY(BSP_GPIOA_12) \
    APPLY(BSP_GPIOA_13) \
    APPLY(BSP_GPIOA_14) \
    APPLY(BSP_GPIOA_15) \
    APPLY(BSP_GPIOB_0) \
    APPLY(BSP_GPIOB_1) \
    APPLY(BSP_GPIOB_2) \
    APPLY(BSP_GPIOB_3) \
    APPLY(BSP_GPIOB_4) \
    APPLY(BSP_GPIOB_5) \
    APPLY(BSP_GPIOB_6) \
    APPLY(BSP_GPIOB_7) \
    APPLY(BSP_GPIOB_8) \
    APPLY(BSP_GPIOB_9) \
    APPLY(BSP_GPIOB_10) \
    APPLY(BSP_GPIOB_11) \
    APPLY(BSP_GPIOB_12) \
    APPLY(BSP_GPIOB_13) \
    APPLY(BSP_GPIOB_14) \
    APPLY(BSP_GPIOB_15) \
    APPLY(BSP_GPIOC_0) \
    APPLY(BSP_GPIOC_1) \
    APPLY(BSP_GPIOC_2) \
    APPLY(BSP_GPIOC_3) \
    APPLY(BSP_GPIOC_4) \
    APPLY(BSP_GPIOC_5) \
    APPLY(BSP_GPIOC_6) \
    APPLY(BSP_GPIOC_7) \
    APPLY(BSP_GPIOC_8) \
    APPLY(BSP_GPIOC_9) \
    APPLY(BSP_GPIOC_10) \
    APPLY(BSP_GPIOC_11) \
    APPLY(BSP_GPIOC_12) \
    APPLY(BSP_GPIOC_13) \
    APPLY(BSP_GPIOC_14) \
    APPLY(BSP_GPIOC_15) \
    APPLY(BSP_GPIOD_0) \
    APPLY(BSP_GPIOD_1) \
    APPLY(BSP_GPIOD_2) \
    APPLY(BSP_GPIOD_3) \
    APPLY(BSP_GPIOD_4) \
    APPLY(BSP_GPIOD_5) \
    APPLY(BSP_GPIOD_6) \
    APPLY(BSP_GPIOD_7) \
    APPLY(BSP_GPIOD_8) \
    APPLY(BSP_GPIOD_9) \
    APPLY(BSP_GPIOD_10) \
    APPLY(BSP_GPIOD_11) \
    APPLY(BSP_GPIOD_12) \
    APPLY(BSP_GPIOD_13) \
    APPLY(BSP_GPIOD_14) \
    APPLY(BSP_GPIOD_15) \
    APPLY(BSP_GPIOE_0) \
    APPLY(BSP_GPIOE_1) \
    APPLY(BSP_GPIOE_2) \
    APPLY(BSP_GPIOE_3) \
    APPLY(BSP_GPIOE_4) \
    APPLY(BSP_GPIOE_5) \
    APPLY(BSP_GPIOE_6) \
    APPLY(BSP_GPIOE_7) \
    APPLY(BSP_GPIOE_8) \
    APPLY(BSP_GPIOE_9) \
    APPLY(BSP_GPIOE_10) \
    APPLY(BSP_GPIOE_11) \
    APPLY(BSP_GPIOE_12) \
    APPLY(BSP_GPIOE_13) \
    APPLY(BSP_GPIOE_14) \
    APPLY(BSP_GPIOE_15) \
    APPLY(BSP_GPIOF_0) \
    APPLY(BSP_GPIOF_1) \
    APPLY(BSP_GPIOF_2) \
    APPLY(BSP_GPIOF_3) \
    APPLY(BSP_GPIOF_4) \
    APPLY(BSP_GPIOF_5) \
    APPLY(BSP_GPIOF_6) \
    APPLY(BSP_GPIOF_7) \
    APPLY(BSP_GPIOF_8) \
    APPLY(BSP_GPIOF_9) \
    APPLY(BSP_GPIOF_10) \
    APPLY(BSP_GPIOF_11) \
    APPLY(BSP_GPIOF_12) \
    APPLY(BSP_GPIOF_13) \
    APPLY(BSP_GPIOF_14) \
    APPLY(BSP_GPIOF_15) \
    APPLY(BSP_GPIOG_0) \
    APPLY(BSP_GPIOG_1) \
    APPLY(BSP_GPIOG_2) \
    APPLY(BSP_GPIOG_3) \
    APPLY(BSP_GPIOG_4) \
    APPLY(BSP_GPIOG_5) \
    APPLY(BSP_GPIOG_6) \
    APPLY(BSP_GPIOG_7) \
    APPLY(BSP_GPIOG_8) \
    APPLY(BSP_GPIOG_9) \
    APPLY(BSP_GPIOG_10) \
    APPLY(BSP_GPIOG_11) \
    APPLY(BSP_GPIOG_12) \
    APPLY(BSP_GPIOG_13) \
    APPLY(BSP_GPIOG_14) \
    APPLY(BSP_GPIOG_15) \
    APPLY(BSP_GPIOH_0) \
    APPLY(BSP_GPIOH_1) \
    APPLY(BSP_GPIOH_2) \
    APPLY(BSP_GPIOH_3) \
    APPLY(BSP_GPIOH_4) \
    APPLY(BSP_GPIOH_5) \
    APPLY(BSP_GPIOH_6) \
    APPLY(BSP_GPIOH_7) \
    APPLY(BSP_GPIOH_8) \
    APPLY(BSP_GPIOH_9) \
    APPLY(BSP_GPIOH_10) \
    APPLY(BSP_GPIOH_11) \
    APPLY(BSP_GPIOH_12) \
    APPLY(BSP_GPIOH_13) \
    APPLY(BSP_GPIOH_14) \
    APPLY(BSP_GPIOH_15) \
    APPLY(BSP_GPIOI_0) \
    APPLY(BSP_GPIOI_1) \
    APPLY(BSP_GPIOI_2) \
    APPLY(BSP_GPIOI_3) \
    APPLY(BSP_GPIOI_4) \
    APPLY(BSP_GPIOI_5) \
    APPLY(BSP_GPIOI_6) \
    APPLY(BSP_GPIOI_7) \
    APPLY(BSP_GPIOI_8) \
    APPLY(BSP_GPIOI_9) \
    APPLY(BSP_GPIOI_10) \
    APPLY(BSP_GPIOI_11)

#define BSP_GPIO_LOAD_CASE(pin_name)                 \
    case pin_name:                                   \
        config.port          = pin_name##_PORT;      \
        config.pin           = pin_name##_PIN;       \
        config.initialize    = pin_name##_INITIALIZE;\
        config.mode          = pin_name##_MODE;      \
        config.pull          = pin_name##_PULL;      \
        config.speed         = pin_name##_SPEED;     \
        config.initial_state = pin_name##_INITIAL_STATE; \
        config.safe_state    = pin_name##_SAFE_STATE;    \
        config.is_output     = pin_name##_IS_OUTPUT; \
        break;

typedef struct
{
    GPIO_TypeDef  *port;
    uint16_t       pin;
    uint32_t       mode;
    uint32_t       pull;
    uint32_t       speed;
    GPIO_PinState  initial_state;
    GPIO_PinState  safe_state;
    bool           initialize;
    bool           is_output;
} bsp_gpio_pin_config_t;

static bool bsp_gpio_pin_is_valid(bsp_gpio_pin_t pin_id)
{
    return (uint32_t)pin_id < (uint32_t)BSP_GPIO_PIN_COUNT;
}

static bool bsp_gpio_level_is_valid(bsp_gpio_level_t level)
{
    return (level == BSP_GPIO_LEVEL_LOW) || (level == BSP_GPIO_LEVEL_HIGH);
}

static bsp_gpio_pin_config_t bsp_gpio_get_config(bsp_gpio_pin_t pin_id)
{
    bsp_gpio_pin_config_t config = {0};

