LuckiBit/stm32-template/stm32f429ig/bootloader/hardware/bsp/gpio/bsp_gpio.c
    switch(pin_id)
    {
        BSP_GPIO_PIN_CONFIG_LIST(BSP_GPIO_LOAD_CASE)

        default:
            break;
    }

    return config;
}

static void bsp_gpio_apply_level(GPIO_TypeDef *port, uint16_t pin, bsp_gpio_level_t level)
{
    uint32_t bsrr_value = (uint32_t)pin;

    if(level == BSP_GPIO_LEVEL_LOW)
    {
        bsrr_value <<= 16U;
    }
    port->BSRR = bsrr_value;
}

static void bsp_gpio_enable_port_clocks(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();
    __HAL_RCC_GPIOI_CLK_ENABLE();
}

void bsp_gpio_init(void)
{
    GPIO_InitTypeDef gpio_config = {0};
    uint32_t         pin_index   = 0U;

    bsp_gpio_enable_port_clocks();

    for(pin_index = 0U; pin_index < (uint32_t)BSP_GPIO_PIN_COUNT; pin_index++)
    {
        bsp_gpio_pin_config_t config = bsp_gpio_get_config((bsp_gpio_pin_t)pin_index);

        if(!config.initialize)
        {
            continue;
        }

        if(config.is_output)
        {
            bsp_gpio_apply_level(config.port,
                                 config.pin,
                                 config.initial_state == GPIO_PIN_SET ? BSP_GPIO_LEVEL_HIGH
                                                                      : BSP_GPIO_LEVEL_LOW);
        }

        gpio_config.Pin   = config.pin;
        gpio_config.Mode  = config.mode;
        gpio_config.Pull  = config.pull;
        gpio_config.Speed = config.speed;
        HAL_GPIO_Init(config.port, &gpio_config);
    }
}

bool bsp_gpio_write(bsp_gpio_pin_t pin_id, bsp_gpio_level_t level)
{
    bsp_gpio_pin_config_t config = {0};

    if(!bsp_gpio_pin_is_valid(pin_id) || !bsp_gpio_level_is_valid(level))
    {
        return false;
    }

    config = bsp_gpio_get_config(pin_id);
    if(!config.initialize || !config.is_output)
    {
        return false;
    }

    bsp_gpio_apply_level(config.port, config.pin, level);
    return true;
}

bool bsp_gpio_toggle(bsp_gpio_pin_t pin_id)
{
    bsp_gpio_pin_config_t config = {0};

    if(!bsp_gpio_pin_is_valid(pin_id))
    {
        return false;
    }

    config = bsp_gpio_get_config(pin_id);
    if(!config.initialize || !config.is_output)
    {
        return false;
    }

    HAL_GPIO_TogglePin(config.port, config.pin);
    return true;
}

bool bsp_gpio_read(bsp_gpio_pin_t pin_id, bsp_gpio_level_t *level)
{
    bsp_gpio_pin_config_t config    = {0};
    GPIO_PinState         pin_state = GPIO_PIN_RESET;

    if(!bsp_gpio_pin_is_valid(pin_id) || (level == NULL))
    {
        return false;
    }

    config = bsp_gpio_get_config(pin_id);
    if(!config.initialize)
    {
        return false;
    }

    pin_state = HAL_GPIO_ReadPin(config.port, config.pin);
    *level = pin_state == GPIO_PIN_SET ? BSP_GPIO_LEVEL_HIGH : BSP_GPIO_LEVEL_LOW;
    return true;
}

void bsp_gpio_safe_state(void)
{
    uint32_t pin_index = 0U;

    for(pin_index = 0U; pin_index < (uint32_t)BSP_GPIO_PIN_COUNT; pin_index++)
    {
        bsp_gpio_pin_config_t config = bsp_gpio_get_config((bsp_gpio_pin_t)pin_index);

        if(config.initialize && config.is_output)
        {
            bsp_gpio_apply_level(config.port,
                                 config.pin,
                                 config.safe_state == GPIO_PIN_SET ? BSP_GPIO_LEVEL_HIGH
                                                                   : BSP_GPIO_LEVEL_LOW);
        }
    }
}
